import {genders, kases} from '../constants.js';

//http://www.slovnyk.ua
var UK = {};

UK.UNITS = {
    'рубль': [
        ['рубль', 'рубля', 'рублю', 'рубль', 'рублем', 'рублі'],
        ['рублі', 'рублів', 'рублям', 'рублі', 'рублями', 'рублях'],
    ],
    'гривня': [
        ['гривня', 'гривні', 'гривні', 'гривню', 'гривнею', 'гривні'],
        ['гривні', 'гривень', 'гривням', 'гривні', 'гривнями', 'гривнях'],
    ],
    'копійка': [
        ['копійка', 'копійки', 'копійці', 'копійку', 'копійкою', 'копійці'],
        ['копійки', 'копійок', 'копійкам', 'копійки', 'копійками', 'копійках'],
    ],
    'долар': [
        ['долар', 'долара', 'долару', 'долар', 'доларом', 'доларі'],
        ['долари', 'доларів', 'доларам', 'долари', 'доларами', 'доларах'],
    ],
    'цент': [
        ['цент', 'цента', 'центу', 'цент', 'центом', 'центі'],
        ['центи', 'центів', 'центам', 'центи', 'центами', 'центах'],
    ],
    'євро': [
        ['євро', 'євро', 'євро', 'євро', 'євро', 'євро'],
        ['євро', 'євро', 'євро', 'євро', 'євро', 'євро'],
    ],
    'фунт ст.': [
        ['фунт ст.', 'фунта ст.', 'фунту ст.', 'фунт ст.', 'фунтом ст.', 'фунті ст.'],
        ['фунти ст.', 'фунтів ст.', 'фунтам ст.', 'фунти ст.', 'фунтами ст.', 'фунтах ст.'],
    ],
    'фунт стерлінгів': [
        ['фунт стерлінгів', 'фунта стерлінгів', 'фунту стерлінгів', 'фунт стерлінгів', 'фунтом стерлінгів', 'фунті стерлінгів'],
        ['фунти стерлінгів', 'фунтів стерлінгів', 'фунтам стерлінгів', 'фунти стерлінгів', 'фунтами стерлінгів', 'фунтах стерлінгів'],
    ],
    'пенні': [
        ['пенні', 'пенні', 'пенні', 'пенні', 'пенні', 'пенні'],
        ['пенні', 'пенні', 'пенні', 'пенні', 'пенні', 'пенні'],
    ],
    'юань': [
        ['юань', 'юаня', 'юаню', 'юань', 'юанем', 'юані'],
        ['юані', 'юанів', 'юаням', 'юані', 'юанями', 'юанях'],
    ],
    'финь': [
        ['финь', 'финя', 'финю', 'финь', 'финем', 'фині'],
        ['фині', 'финів', 'финям', 'фині', 'финями', 'финях'],
    ],
};

UK.MINORS = [
    ['нуль', 'нуля', 'нулю', 'нуль', 'нулем', 'нулі'],
    [
        ['один', 'одна', ['одно', 'одне']],
        ['одного', ['одної', 'однієї'], 'одного'],
        ['одному', 'одній', 'одному'],
        ['один', 'одну', 'одне'],
        ['одним', ['одною', 'однією'], 'одним'],
        [['однім', 'одному'], 'одній', ['однім', 'одному']],
    ],
    [
        ['два', 'дві', 'два'],
        'двох',
        'двом',
        [['двох', 'два'], ['двох', 'дві'], 'два'],
        'двома',
        'двох',
    ],
    [
        'три',
        'трьох',
        'трьом',
        [['трьох', 'три'], ['трьох', 'три'], 'три'],
        'трьома',
        'трьох',
    ],
    [
        'чотири',
        'чотирьох',
        'чотирьом',
        [['чотирьох', 'чотири'], ['чотирьох', 'чотири'], 'чотири'],
        'чотирма',
        'чотирьох',
    ],
    [
        "п'ять", 
        [["п'ятьох", "п'яти"], ["п'ятьох", "п'яти"], "п'яти"], 
        [["п'ятьом", "п'яти"], ["п'ятьом", "п'яти"], "п'яти"], 
        [["п'ятьох", "п'ять"], ["п'ятьох", "п'ять"], "п'ять"], 
        [["п'ятьома", "п'ятьма"], ["п'ятьома", "п'ятьма"], "п'ятьма"], 
        [["п'ятьох", "п'яти"], ["п'ятьох", "п'яти"], "п'яти"], 
    ],
    [
        'шість',
        [['шістьох', 'шести'], ['шістьох', 'шести'], 'шести'],
        [['шістьом', 'шести'], ['шістьом', 'шести'], 'шести'],
        [['шістьох', 'шість'], ['шістьох', 'шість'], 'шість'],
        [['шістьома', 'шістьма'], ['шістьома', 'шістьма'], 'шістьма'],
        [['шістьох', 'шести'], ['шістьох', 'шести'], 'шести'],
    ],
    [
        'сім',
        [['сімох', 'семи'], ['сімох', 'семи'], 'семи'],
        [['сімом', 'семи'], ['сімом', 'семи'], 'семи'],
        [['сімох', 'сім'], ['сімох', 'сім'], 'сім'],
        [['сімома', 'сьома'], ['сімома', 'сьома'], 'сьома'],
        [['сімох', 'семи'], ['сімох', 'семи'], 'семи'],
    ],
    [
        'вісім',
        [['вісьмох', 'восьми'], ['вісьмох', 'восьми'], 'восьми'],
        [['вісьмом', 'восьми'], ['вісьмом', 'восьми'], 'восьми'],
        [['вісьмох', 'вісім'], ['вісьмох', 'вісім'], 'вісім'],
        [['вісьмома', 'вісьма'], ['вісьмома', 'вісьма'], 'вісьма'],
        [['вісьмох', 'восьми'], ['вісьмох', 'восьми'], 'восьми'],
    ],
    [
        "дев'ять",
        [["дев'ятьох", "дев'яти"], ["дев'ятьох", "дев'яти"], "дев'яти"],
        [["дев'ятьом", "дев'яти"], ["дев'ятьом", "дев'яти"], "дев'яти"],
        [["дев'ятьох", "дев'ять"], ["дев'ятьох", "дев'ять"], "дев'ять"],
        [["дев'ятьома", "дев'ятьма"], ["дев'ятьома", "дев'ятьма"], "дев'ятьма"],
        [["дев'ятьох", "дев'яти"], ["дев'ятьох", "дев'яти"], "дев'яти"],
    ],
    [
        'десять',
        [['десятьох', 'десяти'], ['десятьох', 'десяти'], 'десяти'],
        [['десятьом', 'десяти'], ['десятьом', 'десяти'], 'десяти'],
        [['десятьох', 'десять'], ['десятьох', 'десять'], 'десять'],
        [['десятьома', 'десятьма'], ['десятьома', 'десятьма'], 'десятьма'],
        [['десятьох', 'десяти'], ['десятьох', 'десяти'], 'десяти'],
    ],
].concat(
    ['оди', 'два', 'три', 'чотир', "п'ят", 'шіст', 'сім', 'вісім', "дев'ят"].map(function(p) {
        return [
            p+'надцять', 
            [[p+'надцятьох', p+'надцяти'], [p+'надцятьох', p+'надцяти'], p+'надцяти'],
            [[p+'надцятьом', p+'надцяти'], [p+'надцятьом', p+'надцяти'], p+'надцяти'],
            [[p+'надцятьох', p+'надцять'], [p+'надцятьох', p+'надцять'], p+'надцять'],
            [[p+'надцятьома', p+'надцятьма'], [p+'надцятьома', p+'надцятьма'], p+'надцятьма'],
            [[p+'надцятьох', p+'надцяти'], [p+'надцятьох', p+'надцяти'], p+'надцяти'],
        ];
    })
);

UK.TENS = [
    false,
    false,
].concat(
    ['два', 'три'].map(function(p) {
        return [
            p+'дцять',
            [p+'дцятьох', p+'дцяти'],
            [p+'дцятьом', p+'дцяти'],
            [p+'дцятьох', p+'дцять'],
            [p+'дцятьома', p+'дцятьма'],
            [p+'дцятьох', p+'дцяти'],
        ];
    })
).concat([[
    'сорок',
    'сорока',
    'сорока',
    ['сорока', 'сорок'],
    'сорока',
    'сорока',
]]).concat(
    ["п'ят", 'шіст', 'сім', 'вісім', "дев'ят"].map(function(p) {
        return [
            p+'десят',
            [p+'десятьох', p+'десяти'],
            [p+'десятьом', p+'десяти'],
            [p+'десятьох', p+'десят'],
            [p+'десятьома', p+'десятьма'],
            [p+'десятьох', p+'десяти'],
        ];
    })
);

UK.HUNDREDS = [
    false,
    ['сто', 'ста', 'ста', 'сто', 'ста', 'ста'],
    ['двісті', 'двохсот', 'двомстам', ['двохсот', 'двісті'], 'двомастами', 'двохстах'],
    ['триста', 'трьохсот', 'трьомстам', ['трьохсот', 'триста'], 'трьомастами', 'трьохсот'],
    ['чотириста', 'чотирьохсот', 'чотирьомстам', ['чотирьохсот', 'чотириста'], 'чотирмастами', 'чотирьохсот'],
    ["п'ятсот", "п'ятисот", "п'ятистам", "п'ятсот", ["п'ятьомастами", "п'ятьмастами"], "п'ятистах"],
    ['шістсот', 'шестисот', 'шестистам', 'шістсот', ['шістьомастами', 'шістьмастами'], 'шестистах'],
    ['сімсот', 'семисот', 'семистам', 'сімсот', ['сьомастами', 'сімомастами'], 'семистах'],
    ['вісімсот', 'восьмисот', 'восьмистам', 'вісімсот', ['вісьмомастами', 'вісьмастами'], 'восьмистах'],
    ["дев'ятсот", "дев'ятисот", "дев'ятистам", "дев'ятсот", ["дев'ятьомастами", "дев'ятьмастами"], "дев'ятистах"],
];

UK.LARGES = [
    false,
    [
        genders.GENDER_FEMININE,
        ['тисяча', 'тисячі', 'тисяч'],
        ['тисячі', 'тисяч', 'тисяч'],
        ['тисячі', 'тисячам', 'тисячам'],
        ['тисячу', 'тисячі', 'тисяч'],
        ['тисячею', 'тисячами', 'тисячами'],
        ['тисячі', 'тисячах', 'тисячах']
    ]
].concat(['мільйон', 'мільярд', 'трильйон'].map(function(base) {
    return [genders.GENDER_MASCULINE]
        .concat([
            ['', 'и', 'ів'],
            ['а', 'ів', 'ів'],
            ['у', 'ам', 'ам'],
            ['', 'и', 'и'],
            ['ом', 'ами', 'ами'],
            ['і', 'ах', 'ах']
        ].map(function(kase) {
            return kase.map(function(suffix) {
                return base + suffix;
            });
        }));
}));

export default UK;
